let filialebi = [
    {
        name: "თბილისი",
        qvename: "წერეთელი",
        phone: "+995 (32) 2 60 30 60",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "თბილისი",
        qvename: "წერეთლის გამზ. N1",
        phone: "+995 591 967 601",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "თბილისი",
        qvename: "''სითი მოლი'' - პეტრე ქავთარაძის N1",
        phone: "+995 591 971 962",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "თბილისი",
        qvename: "კ.გამსახურდიას (პეკინის) გამზირი ",
        phone: "+995 591 967 671",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 21:00:00"
    },
    {
        name: "თბილისი",
        qvename: "თბილისი ცენტრალი",
        phone: "+995 599 862 449",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "თბილისი",
        qvename: "აღმაშენებლის ხეივანი მე-16 კმ",
        phone: "+995 591 967 608",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "თბილისი",
        qvename: "გლდანი მოლი",
        phone: "+995 591 967 673",
        time1: "ორშ-შაბ: 10:00:00 - 21:00:00",
        time2: "კვირა: 10:00:00 - 20:00:00"
    },
    {
        name: "თბილისი",
        qvename: "ალ. თვალჭრელიძე N2",
        phone: "+995 591 441 082",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "რუსთავი",
        qvename: "შარტავას და ლომოურის კვეთა",
        phone: "+995 591 441 082",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "ბათუმი",
        qvename: "Black Sea Mall",
        phone: "+995 591 310 257",
        time1: "ორშ-შაბ: 10:00:00 - 21:00:00",
        time2: "კვირა: 10:00:00 - 21:00:00"
    },
    {
        name: "ბათუმი",
        qvename: "ბათუმი, ჭავჭავაძის N21",
        phone: "+995 591 967 606",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "ბათუმი",
        qvename: "შერიფ ხიმშიაშვილის 29",
        phone: "+995 591 022 872",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "ქუთაისი",
        qvename: "თამარ მეფის ქ. N3",
        phone: "+955 591 967 605",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "ქუთაისი",
        qvename: "შარტავას N2",
        phone: "+995 595 306 765",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "ქუთაისი",
        qvename: "ჭავჭავაძის ქ. N67",
        phone: "+995 591 967 604",
        time1: "ორშ-შაბ: 10:00:00 - 18:30:00",
        time2: "კვირა: 10:00:00 - 18:30:00"
    },
    {
        name: "ზუგდიდი",
        qvename: "კოსტავას ქუჩა №28",
        phone: "+995 591 676 489",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "თელავი",
        qvename: '"თელავი მოლი" - ალაზნის ქ.N77',
        phone: "+995 595 069 853",
        time1: "ორშ-შაბ: 10:00:00 - 20:00:00",
        time2: "კვირა: 10:00:00 - 20:00:00"
    },
    {
        name: "ახალციხე",
        qvename: "ახალციხე, თამარ მეფის ქ. N9",
        phone: "+995 598 088 659",
        time1: "ორშ-შაბ: 10:00:00 - 19:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "გორი",
        qvename: "გორი, ცხინვალის გზატკეცილი",
        phone: "+995 591 198 248",
        time1: "ორშ-შაბ: 10:00:00 - 22:00:00",
        time2: "კვირა: 10:00:00 - 22:00:00"
    },
    {
        name: "თბილისი",
        qvename: "თბილისი",
        phone: "+995 (32) 2 60 30 60",
        time1: "ორშ-შაბ: 10:00:00 - 19:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    },
    {
        name: "თბილისი",
        qvename: "თბილისი",
        phone: "",
        time1: "ორშ-შაბ: 10:00:00 - 19:00:00",
        time2: "კვირა: 10:00:00 - 19:00:00"
    }
];

let filcont = document.getElementById("filial-container");


filialebi.forEach(filial => {
    filcont.innerHTML += `
        <div class="fil-card">
        <div class="fil-top">
            <div class="fil-left">
                <p>${filial.name}
                <br>
                <span>${filial.qvename}</span>
                </p>
            </div>
            <div class="fil-right">
                <span class="orange-span">${filial.phone}</span>
            </div>
        </div>
        <div class="fil-bottom">
            <div class="tap">
                <span>${filial.time1}</span>
                <br>
                <span>${filial.time2}</span>
            </div>
        </div>
    </div>
    `;
});
